cmsis-svd/cmsis-svd/data/Microchip/ATSAML11E.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>DMAC</name>
         <version>U22232.4.0</version>
         <description>Direct Memory Access Controller</description>
         <groupName>DMAC</groupName>
         <prependToName>DMAC_</prependToName>
         <baseAddress>0x41006000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x50</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>DMAC_0</name>
            <value>11</value>
         </interrupt>
         <interrupt>
            <name>DMAC_1</name>
            <value>12</value>
         </interrupt>
         <interrupt>
            <name>DMAC_2</name>
            <value>13</value>
         </interrupt>
         <interrupt>
            <name>DMAC_3</name>
            <value>14</value>
         </interrupt>
         <interrupt>
            <name>DMAC_OTHER</name>
            <value>15</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRL</name>
               <description>Control</description>
               <addressOffset>0x0</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMAENABLE</name>
                     <description>DMA Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCENABLE</name>
                     <description>CRC Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN0</name>
                     <description>Priority Level 0 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN1</name>
                     <description>Priority Level 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN2</name>
                     <description>Priority Level 2 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLEN3</name>
                     <description>Priority Level 3 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCTRL</name>
               <description>CRC Control</description>
               <addressOffset>0x2</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>CRCBEATSIZE</name>
                     <description>CRC Beat Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCBEATSIZESelect</name>
                        <enumeratedValue>
                           <name>BYTE</name>
                           <description>8-bit bus transfer</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HWORD</name>
                           <description>16-bit bus transfer</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>WORD</name>
                           <description>32-bit bus transfer</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCPOLY</name>
                     <description>CRC Polynomial Type</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CRCPOLYSelect</name>
                        <enumeratedValue>
                           <name>CRC16</name>
                           <description>CRC-16 (CRC-CCITT)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CRC32</name>
                           <description>CRC32 (IEEE 802.3)</description>
                           <value>0x1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCSRC</name>
                     <description>CRC Input Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                     <enumeratedValues>
                        <name>CRCSRCSelect</name>
                        <enumeratedValue>
                           <name>NOACT</name>
                           <description>No action</description>
                           <value>0x00</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IO</name>
                           <description>I/O interface</description>
                           <value>0x01</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN0</name>
                           <description>DMA Channel 0</description>
                           <value>0x20</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN1</name>
                           <description>DMA Channel 1</description>
                           <value>0x21</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN2</name>
                           <description>DMA Channel 2</description>
                           <value>0x22</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN3</name>
                           <description>DMA Channel 3</description>
                           <value>0x23</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN4</name>
                           <description>DMA Channel 4</description>
                           <value>0x24</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN5</name>
                           <description>DMA Channel 5</description>
                           <value>0x25</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN6</name>
                           <description>DMA Channel 6</description>
                           <value>0x26</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CHN7</name>
                           <description>DMA Channel 7</description>
                           <value>0x27</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCDATAIN</name>
               <description>CRC Data Input</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCDATAIN</name>
                     <description>CRC Data Input</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCHKSUM</name>
               <description>CRC Checksum</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCCHKSUM</name>
                     <description>CRC Checksum</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCSTATUS</name>
               <description>CRC Status</description>
               <addressOffset>0xC</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>CRCBUSY</name>
                     <description>CRC Module Busy</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CRCZERO</name>
                     <description>CRC Zero</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control</description>
               <addressOffset>0xD</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>DBGRUN</name>
                     <description>Debug Run</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>QOSCTRL</name>
               <description>QOS Control</description>
               <addressOffset>0xE</addressOffset>
               <size>8</size>
               <resetValue>0x2A</resetValue>
               <fields>
                  <field>
                     <name>WRBQOS</name>
                     <description>Write-Back Quality of Service</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>WRBQOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive Bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive Latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical Latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FQOS</name>
                     <description>Fetch Quality of Service</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>FQOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive Bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive Latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical Latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DQOS</name>
                     <description>Data Transfer Quality of Service</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DQOSSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Background (no sensitive operation)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LOW</name>
                           <description>Sensitive Bandwidth</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MEDIUM</name>
                           <description>Sensitive Latency</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH</name>
                           <description>Critical Latency</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SWTRIGCTRL</name>
               <description>Software Trigger Control</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWTRIG0</name>
                     <description>Channel 0 Software Trigger</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG1</name>
                     <description>Channel 1 Software Trigger</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG2</name>
                     <description>Channel 2 Software Trigger</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG3</name>
                     <description>Channel 3 Software Trigger</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG4</name>
                     <description>Channel 4 Software Trigger</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG5</name>
                     <description>Channel 5 Software Trigger</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG6</name>
                     <description>Channel 6 Software Trigger</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SWTRIG7</name>
                     <description>Channel 7 Software Trigger</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRICTRL0</name>
               <description>Priority Control 0</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>LVLPRI0</name>
                     <description>Level 0 Channel Priority Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RRLVLEN0</name>
                     <description>Level 0 Round-Robin Scheduling Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI1</name>
                     <description>Level 1 Channel Priority Number</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RRLVLEN1</name>
                     <description>Level 1 Round-Robin Scheduling Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI2</name>
                     <description>Level 2 Channel Priority Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RRLVLEN2</name>
                     <description>Level 2 Round-Robin Scheduling Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LVLPRI3</name>
                     <description>Level 3 Channel Priority Number</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>RRLVLEN3</name>
                     <description>Level 3 Round-Robin Scheduling Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTPEND</name>
               <description>Interrupt Pending</description>
               <addressOffset>0x20</addressOffset>
               <size>16</size>
               <resetValue>0x0000</resetValue>
               <fields>
                  <field>
                     <name>ID</name>
                     <description>Channel ID</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>TERR</name>
                     <description>Transfer Error</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TCMPL</name>
                     <description>Transfer Complete</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SUSP</name>
                     <description>Channel Suspend</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FERR</name>
                     <description>Fetch Error</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BUSY</name>
                     <description>Busy</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PEND</name>
                     <description>Pending</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
